---
kind: other
id: Methods.T:Autodesk.Revit.DB.FaceWall
source: html/5b0c0d0b-78de-557c-b8ae-7cb1f85ba759.htm
---
# FaceWall Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.